controllers/StudentsController.php

INSERT INTO `students` (`name`, `email`, `phone`, `from`, `responsible_id`, `appointed_id`, `confirmed_id`, `purpose`, `course_id`, `test_level`, `group_id`, `deposit`, `payments`, `payment_type`, `last_date`, `comment`, `test_mark`) VALUES ('а', 'temar95@mail.ru', '+375293473747', '', 1, 1, 1, '1', '1', 'Beginner', 1, 100, NULL, '', '2017-10-21', '', NULL)
INSERT INTO `user` (`username`, `password`, `email`, `active`, `user_type`, `authKey`, `user_id`) VALUES ('a', 'ispeak17', 'temar95@mail.ru', 0, 1, '104527', 17)
---
    public function actionCreate()
    {
        $model = new Students();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

            $user = new AdminUser();
            $user ->username = strtolower($this->rus2translit(explode(' ', Yii::$app->request->post('Students')['name'])[0]));
            $user ->password = 'ispeak'.$model->id;
            $user ->email = $model->email;
            $user ->active = 0;
            $user ->user_type = 1;
            $user ->authKey = (string)rand(1000, 150000);
            $user ->user_id = $model->id;
            $user ->save();

SELECT * FROM `students` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Students::findOne($id)) !== null) {